In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [8]:
obj = pd.Series([4,7,-5,3])

In [9]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [10]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [12]:
obj2 = pd.Series([4,7,-5,3],index=['d','c','b','a'])

In [13]:
obj2

d    4
c    7
b   -5
a    3
dtype: int64

In [14]:
obj2.index

Index(['d', 'c', 'b', 'a'], dtype='object')

In [15]:
obj2['a']

3

In [16]:
obj2['d']

4

In [17]:
obj2[['c','a','d']]

c    7
a    3
d    4
dtype: int64

In [18]:
obj2['d']=6

In [19]:
obj2[obj2>0]

d    6
c    7
a    3
dtype: int64

In [20]:
obj2*2

d    12
c    14
b   -10
a     6
dtype: int64

In [32]:
import numpy as np

In [23]:
np.exp(obj2)

d     403.428793
c    1096.633158
b       0.006738
a      20.085537
dtype: float64

In [24]:
'b' in obj2

True

In [25]:
'e' in obj2

False

In [38]:
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}

In [39]:
obj3 = pd.Series(sdata)

In [40]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [41]:
states = ['California','Ohio','Oregon','Texas']

In [42]:
obj4 = pd.Series(sdata,index = states)

In [43]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [44]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [45]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [47]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [48]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [49]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [50]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [52]:
obj4.name = 'population'

In [54]:
obj4.index.name = 'state'

In [55]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [56]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [57]:
obj.index = ['Bob','Steve','Jeff','Ryan']

In [58]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [61]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada',],
       'year':[2000,2001,2002,2001,2002],
        'pop':[1.5,1.7,3.6,2.4,2.9]}

In [62]:
frame = pd.DataFrame(data)

In [63]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [64]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [66]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [68]:
frame2=pd.DataFrame(data,columns=['year','state','pop','debt'],
                    index=['one','two','three','four','five'])

In [69]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [70]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [71]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [72]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [73]:
frame2['debt']=16.5

In [74]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [76]:
frame2['debt']=np.arange(5.)

In [77]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [79]:
val = pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])

In [80]:
frame2['debt']=val

In [81]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [82]:
frame2['eastern']=frame2.state=='Ohio'

In [83]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [84]:
del frame2['eastern']

In [85]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [86]:
pop = {'Nevada':{2001:2.4,2002:2.9},
      'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [87]:
frame3 = pd.DataFrame(pop)

In [88]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [89]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [95]:
pd.DataFrame(pop,index=pd.Series([2001, 2002, 2003]))

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [96]:
pdata = {'Ohio':frame3['Ohio'][:-1],
         'Nevada':frame3['Nevada'][:2]}

In [97]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [98]:
frame3.index.name='year';frame3.columns.name='state'

In [99]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [100]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [101]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

In [102]:
obj = pd.Series(range(3),index=['a','b','c'])

In [103]:
index = obj.index

In [104]:
index

Index(['a', 'b', 'c'], dtype='object')

In [105]:
index[1:]

Index(['b', 'c'], dtype='object')

In [106]:
index[1]='d'

TypeError: Index does not support mutable operations

In [108]:
labels = pd.Index(np.arange(3))

In [109]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [111]:
obj2 = pd.Series([1.5,-2.5,0],index = labels)

In [112]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [113]:
obj2.index is labels

True

In [114]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [115]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [116]:
'Ohio' in frame3.columns

True

In [117]:
2003 in frame3.index

False

In [118]:
dup_labels = pd.Index(['foo','foo','bar','bar'])

In [119]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [120]:
obj = pd.Series([4.5,7.2,-5.3,3.6],index=['a','b','c','d'])

In [122]:
obj

a    4.5
b    7.2
c   -5.3
d    3.6
dtype: float64

In [123]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [124]:
obj2

a    4.5
b    7.2
c   -5.3
d    3.6
e    NaN
dtype: float64

In [125]:
obj3 = pd.Series(['blue','purple','yellow'],index=[0,2,4])

In [126]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [127]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [128]:
frame = DataFrame(np.arange(9).reshape((3,3)),
                  index=['a','c','d'],
                 columns=['Ohio','Texas','California'])

In [129]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [130]:
frame2 = frame.reindex(['a','b','c','d'])

In [131]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [132]:
states = ['Texas','Utah','California']

In [133]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [134]:
obj = pd.Series(np.arange(5.),index=['a','b','c','d','e'])

In [135]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [136]:
new_obj = obj.drop('c')

In [137]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [138]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [139]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=['Ohio','Colorado','Utah','New York'],
                   columns=['one','two','three','four'])

In [140]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [141]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [142]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [143]:
data.drop(['two','four'],axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [144]:
obj.drop('c',inplace=True)

In [145]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [146]:
obj=pd.Series(np.arange(4.),index=['a','b','c','d'])

In [147]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [148]:
obj['b']

1.0

In [149]:
obj[1]

1.0

In [150]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [151]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [152]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [153]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [154]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [155]:
obj['b','c']=5

In [156]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [158]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index = ['Ohio','Colorado','Utah','New York'],
                   columns = ['one','two','three','four'])

In [159]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [160]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [161]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [162]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [163]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [164]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [165]:
data[data<5]=0

In [166]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [167]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [168]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [169]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [170]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [171]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [172]:
data.iloc[:, :3][data.three>5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [173]:
ser = pd.Series(np.arange(3.))

In [174]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [175]:
ser[-1]

KeyError: -1

In [176]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [182]:
ser2 = pd.Series(np.arange(3.),index=['a','b','c'])

In [184]:
ser2[-1]

2.0

In [185]:
ser[:1]

0    0.0
dtype: float64

In [186]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [187]:
ser.iloc[:1]

0    0.0
dtype: float64

In [188]:
s1 = pd.Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])

In [189]:
s2=pd.Series([-2.1,3.6,-1.5,4,3.1],index=['a','c','e','f','g'])

In [190]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [191]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [192]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [193]:
df1=pd.DataFrame(np.arange(9.).reshape((3,3)),
                columns=list('bcd'),
                index=['Ohio',"Texas",'Oregon'])

In [194]:
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)),
                  columns=list('bde'),
                  index=['Utah','Ohio','Texas','Oregon'])

In [195]:
df1

          b    c    d
Ohio    0.0  1.0  2.0
Texas   3.0  4.0  5.0
Oregon  6.0  7.0  8.0

In [196]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [197]:
df1+df2

           b   c     d   e
Ohio     3.0 NaN   6.0 NaN
Oregon  15.0 NaN  18.0 NaN
Texas    9.0 NaN  12.0 NaN
Utah     NaN NaN   NaN NaN

In [200]:
df1 = pd.DataFrame({'A':[1,2]})

In [201]:
df2 = pd.DataFrame({'B':[3,4]})

In [202]:
df1

   A
0  1
1  2

In [203]:
df2

   B
0  3
1  4

In [204]:
df1-df2

    A   B
0 NaN NaN
1 NaN NaN

In [205]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),
                   columns=list('abcd')
                  )

In [206]:
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),
                  columns = list('abcde'))

In [207]:
df2.loc[1,'b']=np.nan

In [208]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [209]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [210]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [211]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [212]:
1/df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [213]:
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [214]:
df1.reindex(columns=df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [216]:
arr = np.arange(12.).reshape((3,4))

In [217]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [218]:
arr[0]

array([0., 1., 2., 3.])

In [219]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [221]:
frame=pd.DataFrame(np.arange(12.).reshape((4,3)),
                  columns=list('bde'),
                  index=['Utah','Ohio',"Texas",'Oregon'])

In [222]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [223]:
series = frame.iloc[0]

In [224]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [225]:
frame-series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [226]:
series2= pd.Series(range(3),index=['b','e','f'])

In [227]:
series2

b    0
e    1
f    2
dtype: int64

In [228]:
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [229]:
series3= frame['d']

In [230]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [232]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [233]:
frame.sub(series3,axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [8]:
frame = pd.DataFrame(np.random.randn(4,3),columns=list('bde'),
                    index=['Utah','Ohio','Texas','Oregon'])

In [236]:
frame

               b         d         e
Utah   -1.112567 -0.140402  2.249433
Ohio   -0.879002 -0.570087  1.588372
Texas   1.348889 -1.264872 -1.114515
Oregon -1.767829  0.112307  1.021517

In [238]:
np.abs(frame)

               b         d         e
Utah    1.112567  0.140402  2.249433
Ohio    0.879002  0.570087  1.588372
Texas   1.348889  1.264872  1.114515
Oregon  1.767829  0.112307  1.021517

In [241]:
f=lambda x:x.max()-x.min()

In [242]:
frame.apply(f)

b    3.116718
d    1.377179
e    3.363947
dtype: float64

In [243]:
frame.apply(f,axis='columns')

Utah      3.362000
Ohio      2.467374
Texas     2.613761
Oregon    2.789346
dtype: float64

In [244]:
def f(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])

In [245]:
frame.apply(f)

            b         d         e
min -1.767829 -1.264872 -1.114515
max  1.348889  0.112307  2.249433

In [1]:
format=lambda x:'%.2f'%x

In [5]:
import pandas as pd

In [7]:
import numpy as np

In [9]:
frame.applymap(format)

            b      d      e
Utah     0.29   0.23   1.43
Ohio     0.80   0.79   0.74
Texas   -0.36  -0.89  -0.31
Oregon   2.68  -0.02  -0.33

In [10]:
frame['e'].map(format)

Utah       1.43
Ohio       0.74
Texas     -0.31
Oregon    -0.33
Name: e, dtype: object

In [11]:
obj = pd.Series(range(4),index=['d','a','b','c'])

In [12]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [14]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [15]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
                    index=['three','one'],
                    columns=['d','a','b','c'])

In [16]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [17]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [18]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [19]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [20]:
obj = pd.Series([4,7,-3,2])

In [21]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [22]:
obj = pd.Series([4,np.nan,7,np.nan,-3,2])

In [24]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [25]:
frame = pd.DataFrame({'b':[4,7,-3,2],'a':[0,1,0,-1]})

In [26]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2 -1

In [27]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2 -1
0  4  0
1  7  1

In [28]:
frame.sort_values(by=['a','b'])

   b  a
3  2 -1
2 -3  0
0  4  0
1  7  1

In [29]:
obj=pd.Series([7,-5,7,4,2,0,4])

In [30]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [31]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [32]:
obj.rank(ascending=False,method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [34]:
frame = pd.DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})

In [35]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [37]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [38]:
obj=pd.Series(range(5),index=['a','a','b','b','c'])

In [39]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [40]:
obj.index.is_unique

False

In [41]:
obj['a']

a    0
a    1
dtype: int64

In [42]:
obj['c']

4

In [43]:
df = pd.DataFrame(np.random.randn(4,3),index=['a','a','b','b'])

In [44]:
df

          0         1         2
a -0.339438 -0.657095 -1.502807
a -0.464801 -0.677046 -2.396977
b  0.184174  1.673548  1.304252
b  0.122386 -0.912818  0.020985

In [45]:
df.loc['b']

          0         1         2
b  0.184174  1.673548  1.304252
b  0.122386 -0.912818  0.020985

In [48]:
df = pd.DataFrame([[1.4,np.nan],
                  [7.1,-4.5],
                  [np.nan,np.nan],
                  [0.75,-1.3]],
                 index=['a','b','c','d'],
                 columns=['one','two'])

In [49]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [50]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [51]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [52]:
df.mean(axis='columns',skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [53]:
df.idxmax()

one    b
two    d
dtype: object

In [54]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [55]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [56]:
obj = pd.Series(['a','a','b','c']*4)

In [57]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [58]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [64]:
pd.core.common.is_list_like = pd.api.types.is_list_like

In [68]:
import pandas_datareader.data as web

In [71]:
all_data = {ticker:web.get_data_yahoo(ticker)
           for ticker in ['IBM','MSFT','GOOG']}

In [74]:
price = pd.DataFrame({ticker:data['Adj Close']
                     for ticker,data in all_data.items()})

In [75]:
volume = pd.DataFrame({ticker:data['Volume']
                      for ticker,data in all_data.items()})

In [76]:
returns = price.pct_change()

In [77]:
returns.tail()

                 IBM      MSFT      GOOG
Date
2019-05-07 -0.019518 -0.020523 -0.012855
2019-05-08  0.002616 -0.000080 -0.006669
2019-05-09 -0.007626 -0.000080 -0.003335
2019-05-10 -0.000148  0.012988  0.001626
2019-05-13 -0.028821 -0.029733 -0.027691

In [78]:
returns['MSFT'].corr(returns['IBM'])

0.486732321161966

In [79]:
returns['MSFT'].cov(returns['IBM'])

8.677116893503546e-05

In [80]:
returns.corr()

           IBM      MSFT      GOOG
IBM   1.000000  0.486732  0.404525
MSFT  0.486732  1.000000  0.535114
GOOG  0.404525  0.535114  1.000000

In [81]:
returns.cov()

           IBM      MSFT      GOOG
IBM   0.000152  0.000087  0.000077
MSFT  0.000087  0.000209  0.000120
GOOG  0.000077  0.000120  0.000238

In [82]:
returns.corrwith(returns.IBM)

IBM     1.000000
MSFT    0.486732
GOOG    0.404525
dtype: float64

In [83]:
returns.corrwith(volume)

IBM    -0.155709
MSFT   -0.089318
GOOG   -0.020082
dtype: float64

In [85]:
returns.corrwith(volume,axis=1)

Date
2009-12-31         NaN
2010-01-04    0.990557
2010-01-05    0.780143
2010-01-06    0.479027
2010-01-07    0.023779
2010-01-08   -0.801401
2010-01-11   -0.552518
2010-01-12   -0.103786
2010-01-13    0.933712
2010-01-14    0.691263
2010-01-15    0.518198
2010-01-19   -0.815264
2010-01-20    0.115379
2010-01-21   -0.776741
2010-01-22    0.226237
2010-01-25    0.653042
2010-01-26    0.659433
2010-01-27    0.648733
2010-01-28    0.018521
2010-01-29   -0.996217
2010-02-01   -0.315735
2010-02-02   -0.032565
2010-02-03   -0.211399
2010-02-04   -0.675556
2010-02-05   -0.007728
2010-02-08   -0.599940
2010-02-09    0.438176
2010-02-10    0.989157
2010-02-11   -0.264643
2010-02-12   -0.521291
                ...
2019-04-01   -0.988799
2019-04-02   -0.092244
2019-04-03    0.993118
2019-04-04   -0.526484
2019-04-05    0.654621
2019-04-08    0.470370
2019-04-09    0.405991
2019-04-10    0.834246
2019-04-11   -0.541131
2019-04-12   -0.444286
2019-04-15    0.054007
2019-04-16   -0.725195
2019-04-17   -0.129685
2019-04-18    0.831991
2019-04-22   -0.058503
2019-04-23    0.729703
2019-04-24    0.557507
2019-04-25    0.917977
2019-04-26   -0.607747
2019-04-29   -0.423393
2019-04-30    0.414067
2019-05-01   -0.611597
2019-05-02   -0.979609
2019-05-03    0.560182
2019-05-06   -0.977822
2019-05-07   -0.665258
2019-05-08    0.315939
2019-05-09    0.759477
2019-05-10    0.978825
2019-05-13   -0.878952
Length: 2356, dtype: float64

In [86]:
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])

In [88]:
uniques = obj.unique()

In [89]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [91]:
uniques.sort()

In [92]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [93]:
pd.value_counts(obj.values,sort=False)

d    1
a    3
b    2
c    3
dtype: int64

In [94]:
mask = obj.isin(['b','c'])

In [95]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [96]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [97]:
data = pd.DataFrame({'Qu1':[1,3,4,3,4],
                    'Qu2':[2,3,1,2,3],
                    'Qu3':[1,5,2,4,4]})

In [98]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [99]:
result=data.apply(pd.value_counts).fillna(0)

In [100]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [111]:
!type examples_data_for_data_analysis\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [105]:
df = pd.read_csv('examples_data_for_data_analysis/ex1.csv')

In [106]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [109]:
pd.read_table('examples_data_for_data_analysis/ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [112]:
!type examples_data_for_data_analysis\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [113]:
pd.read_csv("examples_data_for_data_analysis/ex2.csv",header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [114]:
pd.read_csv('examples_data_for_data_analysis/ex2.csv',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [115]:
names=['a','b','c','d','message']

In [116]:
pd.read_csv('examples_data_for_data_analysis/ex2.csv',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [117]:
!type examples_data_for_data_analysis\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [118]:
parsed=pd.read_csv("examples_data_for_data_analysis/csv_mindex.csv",
                  index_col=['key1','key2'])

In [119]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [120]:
list(open('examples_data_for_data_analysis/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [121]:
result = pd.read_table('examples_data_for_data_analysis/ex3.txt',sep='\s+')

In [122]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [123]:
!type examples_data_for_data_analysis\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [124]:
pd.read_csv('examples_data_for_data_analysis/ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [125]:
!type examples_data_for_data_analysis\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [126]:
result = pd.read_csv('examples_data_for_data_analysis/ex5.csv')

In [127]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [128]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [129]:
result=pd.read_csv('examples_data_for_data_analysis/ex5.csv',na_values=['NULL'])

In [130]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [131]:
sentinels={'message':['foo','NA'],'something':['two']}

In [132]:
pd.read_csv('examples_data_for_data_analysis/ex5.csv',na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [133]:
pd.options.display.max_rows=10

In [134]:
result = pd.read_csv('examples_data_for_data_analysis/ex6.csv')

In [135]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [136]:
pd.read_csv('examples_data_for_data_analysis/ex6.csv',nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [137]:
chunker = pd.read_csv('examples_data_for_data_analysis/ex6.csv',chunksize=1000)

In [138]:
chunker

In [139]:
chunker = pd.read_csv('examples_data_for_data_analysis/ex6.csv',chunksize=1000)

In [140]:
tot = pd.Series([])

In [141]:
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value=0)

In [142]:
tot = tot.sort_values(ascending=False)

In [143]:
tot

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
     ...
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
Length: 36, dtype: float64

In [144]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [145]:
data = pd.read_csv('examples_data_for_data_analysis/ex5.csv')

In [146]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [147]:
data.to_csv('examples_data_for_data_analysis/out.csv')

In [149]:
!type examples_data_for_data_analysis\out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [150]:
import sys

In [151]:
data.to_csv(sys.stdout,na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [152]:
data.to_csv(sys.stdout,sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [153]:
data.to_csv(sys.stdout,index=False,header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [154]:
data.to_csv(sys.stdout,index=False,columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [155]:
dates=pd.date_range('1/1/2000',periods=7)

In [156]:
ts=pd.Series(np.arange(7),index=dates)

In [157]:
ts.to_csv('examples_data_for_data_analysis/tseries.csv')

In [158]:
!type examples_data_for_data_analysis\tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [159]:
!type examples_data_for_data_analysis\ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [170]:
import csv
f = open('examples_data_for_data_analysis/ex7.csv')
reader=csv.reader(f)

In [161]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [162]:
with open('examples_data_for_data_analysis/ex7.csv') as f:
    lines=list(csv.reader(f))

In [163]:
header,values=lines[0],lines[1:]

In [164]:
data_dict = {h: v for h,v in zip(header,zip(*values))}

In [165]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [167]:
class my_dialect(csv.Dialect):
    lineterminator='\n'
    delimiter=';'
    quotechar='"'
    quoting=csv.QUOTE_MINIMAL

In [171]:
reader = csv.reader(f,dialect=my_dialect)

In [172]:
reader = csv.reader(f,delimiter='|')

In [173]:
reader

In [174]:
with open('mydata.csv','w') as f:
    writer=csv.writer(f,dialect=my_dialect)
    writer.writerow(('one','two','three'))
    writer.writerow(('1','2','3'))
    writer.writerow(('4','5','6'))
    writer.writerow(('7','8','9'))

In [175]:
f.close()

In [176]:
obj="""
{"name":"Wes",
"place_lived":["United States","Spain","Germany"],
"pet":null,
"siblings":[{"name":"Scott","age":30,"pet":["Zeus","Zuko"]},
            {"name":"Katie","age":38,
            "pet":["Sixes","Stache","Cisco"]}]
}
"""

In [177]:
import json

In [178]:
result = json.loads(obj)

In [179]:
result

{'name': 'Wes',
 'place_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pet': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pet': ['Sixes', 'Stache', 'Cisco']}]}

In [180]:
asjson=json.dumps(result)

In [181]:
asjson

'{"name": "Wes", "place_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pet": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pet": ["Sixes", "Stache", "Cisco"]}]}'

In [182]:
siblings = pd.DataFrame(result['siblings'],columns=['name','age'])

In [183]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [184]:
!type examples_data_for_data_analysis\example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [185]:
data = pd.read_json('examples_data_for_data_analysis/example.json')

In [186]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [187]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [188]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [3]:
tables = pd.read_html('examples_data_for_data_analysis/fdic_failed_bank_list.html')

In [4]:
len(tables)

1

In [5]:
failures=tables[0]

In [6]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [7]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [8]:
close_timestamps

0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
5     2015-10-02
6     2015-10-02
7     2015-07-10
8     2015-05-08
9     2015-02-27
10    2015-02-13
11    2015-01-23
12    2015-01-16
13    2014-12-19
14    2014-11-07
15    2014-10-24
16    2014-10-17
17    2014-07-25
18    2014-07-18
19    2014-06-27
20    2014-06-20
21    2014-06-20
22    2014-05-30
23    2014-05-23
24    2014-05-16
25    2014-04-25
26    2014-02-28
27    2014-02-28
28    2014-01-31
29    2014-01-24
         ...
517   2008-05-09
518   2008-03-07
519   2008-01-25
520   2007-10-04
521   2007-09-28
522   2007-02-02
523   2004-06-25
524   2004-03-19
525   2004-03-12
526   2004-02-14
527   2003-11-14
528   2003-05-09
529   2003-02-07
530   2002-12-17
531   2002-11-08
532   2002-09-30
533   2002-06-27
534   2002-06-26
535   2002-03-28
536   2002-03-01
537   2002-02-07
538   2002-02-01
539   2002-01-18
540   2002-01-11
541   2001-09-07
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

In [11]:
from lxml import objectify
path='examples_data_for_data_analysis/Performance_MNR.xml'
parsed = objectify.parse(open (path))
root = parsed.getroot()

In [12]:
data=[]

In [16]:
skip_field=['PARENT_SEQ','INDICATOR_SEQ',
           'DESIRED_CHANGE','DECIMAL_PLACES']
for elt in root.INDICATOR_NAME:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag]=child.pyval
    data.append(el_data)

In [17]:
perf=pd.DataFrame(data)

In [18]:
perf.head()

Empty DataFrame
Columns: []
Index: [0]

In [19]:
from io import StringIO
tag='<a href="http://www.google.com">Google</a>'

In [20]:
root = objectify.parse(StringIO(tag)).getroot()

In [21]:
root

In [22]:
root.get('href')

'http://www.google.com'

In [23]:
root.text

'Google'

In [24]:
frame = pd.read_csv('examples_data_for_data_analysis/ex1.csv')

In [25]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [26]:
frame.to_pickle('examples_data_for_data_analysis/frame_pickle')

In [27]:
pd.read_pickle('examples_data_for_data_analysis/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [33]:
frame=pd.DataFrame({'a':np.random.randn(100)})

In [34]:
store = pd.HDFStore('mydata.h5')

In [35]:
store['obj1']=frame

In [36]:
store['obj1_col']=frame['a']

In [37]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [38]:
store['obj1']

           a
0   0.289827
1   0.347725
2  -0.269740
3   1.241688
4   0.526722
5   0.193579
6  -0.653521
7  -0.529468
8  -0.430160
9  -0.348015
10  0.138729
11 -0.409954
12 -0.062217
13 -0.516316
14  0.125216
15  0.255233
16 -0.009795
17  1.152524
18  0.684028
19 -0.228016
20  0.253522
21  1.472222
22 -1.498494
23  1.497119
24 -1.676431
25  0.334314
26 -0.435484
27  1.246369
28  0.343982
29 -0.265931
..       ...
70 -0.059611
71 -0.854868
72 -0.475870
73  3.023277
74  0.798058
75  0.495659
76  1.993758
77 -0.227396
78  0.037883
79 -1.680922
80 -1.392883
81 -1.045020
82  1.026600
83  1.460116
84 -0.708665
85 -1.375287
86  1.404767
87 -0.718561
88 -0.279261
89 -1.861661
90  0.541142
91  0.059851
92 -0.619161
93 -0.022573
94  1.215415
95  1.115355
96  0.091258
97  1.082780
98  0.283064
99 -0.486091

[100 rows x 1 columns]

In [39]:
store.put('obj2',frame,format='table')

In [40]:
store.select('obj2',where=['index>=10 and index<=15'])

           a
10  0.138729
11 -0.409954
12 -0.062217
13 -0.516316
14  0.125216
15  0.255233

In [41]:
store.close()

In [42]:
frame.to_hdf('mydata.h5','obj3',format='table')

In [43]:
pd.read_hdf('mydata.h5','obj3',where=['index<5'])

          a
0  0.289827
1  0.347725
2 -0.269740
3  1.241688
4  0.526722

In [44]:
xlsx = pd.ExcelFile('examples_data_for_data_analysis/ex1.xlsx')

In [45]:
pd.read_excel(xlsx,'Sheet1')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [46]:
frame = pd.read_excel('examples_data_for_data_analysis/ex1.xlsx')

In [47]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [48]:
writer = pd.ExcelWriter('examples_data_for_data_analysis/ex2.xlsx')

In [49]:
frame.to_excel(writer,'Sheet1')

In [50]:
writer.save()

In [51]:
frame.to_excel('examples_data_for_data_analysis/ex2.xlsx')

In [52]:
import requests

In [53]:
url='http://api.github.com/repos/pandas-dev/pandas/issues'

In [54]:
resp=requests.get(url)

In [55]:
resp

In [56]:
data = resp.json()

In [57]:
data[0]['title']

'DEPR: deprecate Series/DataFrame.compound'

In [58]:
issues = pd.DataFrame(data,columns=['number','title','labels','state'])

In [59]:
issues

,number,title,labels,state
0,26405,DEPR: deprecate Series/DataFrame.compound,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
1,26404,Fix type annotations in pandas.core.indexes.da...,[],open
2,26403,DEPR: Deprecate ordered=None for CategoricalDtype,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
3,26402,DOC: Test doctests in pandas/core/tools/dateti...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
4,26401,Test doctests in pandas/core/tools/datetimes.py,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
5,26400,ENH: Support multiple opening hours intervals ...,[],open
6,26399,ENH: Support nested renaming / selection,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
7,26398,Fix type annotations in pandas.core.resample,"[{'id': 74975453, 'node_id': 'MDU6TGFiZWw3NDk3...",open
8,26397,DataFrame.describe excludes top and freq for e...,[],open
9,26396,CLN: remove compat.lrange,"[{'id': 49747336, 'node_id': 'MDU6TGFiZWw0OTc0...",open
10,26395,different type conversion results in assignmen...,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open
11,26394,BUG: to_numeric does not validate the errors k...,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
12,26393,Holiday based on the lunar calendar?,[],open
13,26392,[TEST] Add two more parameters to the test_dti...,"[{'id': 53181044, 'node_id': 'MDU6TGFiZWw1MzE4...",open
14,26391,[PERF] Get rid of MultiIndex conversion in Int...,"[{'id': 150096370, 'node_id': 'MDU6TGFiZWwxNTA...",open
15,26390,BUG: assigning Series.array / PandasArray to c...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
16,26389,Converting json to csv,"[{'id': 307649777, 'node_id': 'MDU6TGFiZWwzMDc...",open
17,26388,read_parquet S3 dir support,"[{'id': 685114413, 'node_id': 'MDU6TGFiZWw2ODU...",open
18,26385,GroupBy nth ignores observed keyword for Categ...,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
19,26384,Remove Deprecated Azure CI Step,[],open
20,26383,Prefixed batch script commands with call,[],open
21,26381,BUG: error calculating BusinessHourMixin.apply...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
22,26380,ENH: Implementing NEP 18's __array_function__,[],open
23,26379,BUG: Series.combine_first with mixed timezones,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
24,26377,Fix type annotations in pandas.core.ops,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
25,26376,pd.read_fwf fails with file pointer to url,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,26374,BUG: ngroups and len(groups) do not equal when...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
27,26372,Misc Type Annotation fixes,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
28,26370,Feature requests: pandas.DataFrame.quantile wi...,[],open
29,26368,corrwith in 0.24 is much slower than 0.23 (esp...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open

In [60]:
import sqlite3

In [67]:
query = """
CREATE TABLE test
(a VARCHAR(20),b VARCHAR(20),
 c REAL,        d INTEGER
);"""

In [68]:
con = sqlite3.connect('mydata.sqlite')

In [69]:
con.execute(query)

In [70]:
con.commit()

In [71]:
data=[('Atlanta','Georgia',1.25,6),
     ('Tallahassee','Florida',2.6,3),
     ('Sacramento','California',1.7,5)]

In [74]:
stmt="INSERT INTO test VALUES(?,?,?,?)"

In [75]:
con.executemany(stmt,data)

In [76]:
con.commit()

In [77]:
cursor=con.execute('select * from test')

In [78]:
rows = cursor.fetchall()

In [79]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [80]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [81]:
pd.DataFrame(rows,columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [82]:
import sqlalchemy as sqla

In [83]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [84]:
pd.read_sql('select * from test',db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5